//
//  data.swift
//  present_fac
//
//  Created by iStudents on 2/27/15.
//  Copyright (c) 2015 iStudents. All rights reserved.
//

import UIKit

class data: NSObject {
   
    func getData() -> Array<fac> {
    var tempArray = Array<fac>()
    
        let f1 = fac(fImage: UIImage(named: "msu1.jpg"), fName: "มหาวิทยาลัยมหาสารคาม",fBa: " คติพจย์ พหูนํ ปณฺฑิโต ชีเว หมายความว่า ผู้มีปัญญาพึงเป็นอยู่เพื่อมหาชน 1.ตราโรจนากร คือ ตราประจำมหาวิทยาลัยมหาสารคาม ซึ่งมีความหมายว่า สัญลักษณ์แห่งความเจริญรุ่งเรือง 2.ต้นไม้ประจำมหาวิทยาลัย ต้นราชพฤกษ์ หรือ ต้นคูณ 3.สีประจำมหาวิทยาลัย คือ สีเหลือง - เทา")
    tempArray.append(f1)
    
        let f2 = fac(fImage: UIImage(named: "facit.jpg"), fName: "คณะวิทยาการสารสนเทศ",fBa: "คณะ วิทยาการสารสนเทศเปิดสอนทั้งหมด 6 สาขา คือ วิทยาการคอมพิวเตอ สารสนเทศศาสตร์ นิเทศศาสตร์ สื่อนฤมิตร ภูมิสารสนเทศศาสตร์ และ เทคโนโลยีสารสนเทศและการสื่อสาร")
    tempArray.append(f2)
    
        let f3 = fac(fImage: UIImage(named: "en.jpg"), fName: "คณะวิศวะกรรมศาสตร์ ",fBa:"คณะวิศวะกรรมศาสตร์ มีเปิดทั้งหมด 7 สาขา วิศวะเครื่องกล วิศวะเมคาทอนิก วิศวะโยธา วิศวะสิ่งแวดล้อม วิศวะไฟฟ้า วิศวะกรรมการผลิต วิศวะกรรมชีวะภาพ")
    tempArray.append(f3)
        let f4 = fac(fImage: UIImage(named: "nu.jpg"), fName: "คณะพยาบาลศาสตร์",fBa:"คณะพยาบาลศาตร์ เปิดสอนหลักสูตรเดียวคือหลักสูตร พยาบาลศาสตร์บันฑิต")
    tempArray.append(f4)
        let f5 = fac(fImage: UIImage(named: "medicin.jpg"), fName: "คณะเภสัชศาสตร์",fBa:"คณะเภสัชศาสตร์ เปิดสอน 1 หลักสูตรคือ หลักสูตร เภสัชศาสตร์บัณฑิต")
        tempArray.append(f5)
        let f6 = fac(fImage: UIImage(named: "mbs.jpg"), fName: "คณะบัญชีและการจัดการ",fBa:"คณะบัญชีและการจัดการ เปิดสอน 11 หลักสูตรคือ 1.สาขาการบัญชี 2.สาขาการจัดการ 3.สาขาการจัดการพาณิชย์อิเล็กทรอนิกส์ 4.สาขาวิชาการจัดการการประกอบการ 5.สาขาการจัดการทรัพยากรมนุษย์ 6.สาขาเศรษฐศาสตร์ธุรกิจ 7.สาขาธุรกิจระหว่างประเทศ 8.สาขาการตลาด 9.สาขาการบริหารการเงิน 10.สาขาเทคโนโลยีสารสนเทศธุรกิจ 11.สาขาคอมพิวเตอร์ธุรกิจ")
        tempArray.append(f6)
        let f7 = fac(fImage: UIImage(named: "husoc.jpg"), fName: "คณะมนุษศาสตร์ฯ",fBa:"คณะมนุษย์ศาสตร์และสังคมศาสตร์เปิดหลักสูตรทั้งหมด 13 หลักสูตรคือ 1.ภาษาไทย 2.ภาษาจีน 3.ภาษาอาเซียน 4.ภาษาญี่ปุ่น 5.ภาษาเกาหลี 6.สื่อสิ่งพิมพ์ 7.การพัฒนาชุมชน 8.สาขาประวัติศาสตร์ 9.ภาษาอังกฤษ 10.อังกฤษธุรกิจ 11.นานาชาติ 12.ฝรั่งเศส 13.การจัดการทรัพยากร")
        tempArray.append(f7)
        let f8 = fac(fImage: UIImage(named: "pimarsy.jpg"), fName: "คณะแพทย์ศาสตร์ฯ",fBa:"คณะแพทย์ศาสตร์ เปิดสอนหลักสูตรทั้งหมด 3 หลักสูตร คือ 1.แพทย์ศาสตร์บัณฑิต 2.แพทย์แผนไทยประยุกต์บัณฑิต 3.เวชกิจฉุกเฉิน")
        tempArray.append(f8)
        let f9 = fac(fImage: UIImage(named: "pub.jpg"), fName: "คณะสาธารณสุขศาตร์",fBa:"คณะสาธารณสุขศาสตร์ เปิดสอนหลักสูตรทั้งหมด 3 หลักสูตร คือ 1.สาธารณสุขศาสตร์บัณฑิต 2.โภชนาการฯ 3.อนามัยสิ่งแวดล้อม")
        tempArray.append(f9)
        let f10 = fac(fImage: UIImage(named: "sci.jpg"), fName: "คณะวิทยาศาสตร์",fBa:"คณะวิทยาศาสตร์ เปิดสอนหลักสูตรทั้งหมด 7 หลักสูตร คือ 1.สาขาวิชาเคมี 2.สาขาวิชาชีววิทยา 3.สาขาวิชาฟิสิกส์ 4.สาขาวิชาฟิสิกส์ประยุกต์ 5.สาขาวิชา๕ณิตศาสตร์ 6.สาขาวิชาสถิติ 7.สาขาวิชาจุลชีววิทยา")
        tempArray.append(f10)
        let f11 = fac(fImage: UIImage(named: "tech.jpg"), fName: "คณะเทคโนโลยี",fBa:"คณะเทคโนโลยี เปิดสอนหลักสูตรทั้งหมด 3 ภาควิชา แยกย่อยๆคือ 1.ภาควิชาเทคโนโลยีชีวภาพ เปิดสอนหลักสูตร สาขาเทคโนโลยีชีวะภาพ 2.ภาควิชาเทคโนโลยีการเกษตร แยกเป็น 3 สาขาคือ 2.1สาขาเทคโนโลยีการเกษตร 2.2สาขาสัตว์ศาสตร์ 2.3สาขาประมง และภาควิชาเทคโนโลยีอาหารและโภชนศาสตร์ แยกออกเป็น 2 สาขาคือ 3.1สาขาเทคโนโลยีการอาหาร 3.2สาขาพัฒนาผลิตภัณฑ์")
        tempArray.append(f11)
        let f12 = fac(fImage: UIImage(named: "tapad.jpg"), fName: "คณะสถาปัตย์ฯ",fBa:"คณะสถาปัตย์ฯ เปิดสอนหลักสูตรทั้งหมด 4 หลักสูตร 1.หลักสูตรสถาปัตยกรรมศาสตรบัณฑิต 2.หลักสูตรศิลปกรรมศาสตรบัณฑิต 3.หลักสูตรภูมิสถาปัตยกรรมศาสตรบัณฑิต 4.การวางผังชุมชนเมืองและสภาพแวดล้อม")
        tempArray.append(f12)
        let f13 = fac(fImage: UIImage(named: "envi.jpg"), fName: "คณะสิ่งแวดล้อมฯ",fBa:"คณะสิ่งแวดล้อมฯ เปิดสอนหลักสูตรทั้งหมด 3 สาขาวิชา 1.สาขาเทคโนโลยีสิ่งแวดล้อม 2.สาขาการจัดการสิ่งแวดล้อมและทรัพยากร 3.สาขาวิชาสิ่งแวดล้อมศึกษา")
        tempArray.append(f13)
        let f14 = fac(fImage: UIImage(named: "sinrapa.jpg"), fName: "คณะศิลปกรรมศาสตร์",fBa:"คณะศิลปกรรมศาสตร์ เปิดสอนหลักสูตรทั้งหมด 4 หลักสูตร 1.สาขาวิชาทัศนศิลป์ เอกจิตรกรรม เอกประติมากรรม เอกศิลปะภาพพิมพ์ เอกศิลปะไทย เอกศิลปะดิจิทัล 2.สาขาศิลปะการแสดง เอกนาฏศิลป์ไทย เอกนาฏยพื้นเมือง เอกนาฏยศิลป์ตะวันตก เอกการแสดงเวทีและภาพยนต์ 3.สาขาวิชาทัศนศิลป์ 4.สาขาวิชานาฏยศิลป์")
        tempArray.append(f14)
        tempArray.append(f13)
        let f15 = fac(fImage: UIImage(named: "music.jpg"), fName: "วิลัยดุริยางฯ",fBa:"วิลัยดุริงยางฯ เปิดสอนหลักสูตรทั้งหมด 4 หลักสูตร 1.ดนตรีพื้นบ้าน 2.ดนตรีไทย 3.ดนตรีตะวันตก 4.ดนตรีสากล")
        tempArray.append(f15)
        let f16 = fac(fImage: UIImage(named: "niti.jpg"), fName: "วิลัยการเมืองฯ",fBa:"วิลัยการเมืองฯ เปิดสอนหลักสูตรทั้งหมด 3 หลักสูตร 1.หลักสูตรรัฐศาสตรบัณฑิต 2.หลักศูตรศิลปศาสตรบัรฑิต 3.หลักสูตรรัฐประศาสนศาสตรบัณฑิต")
        tempArray.append(f16)
        
        
        
    return tempArray
    
    
    
    
    
    }
}
